Revit 2024 API
BuiltInFailures.RoofFailures.RoofToRefPlanes Property
 Roof cannot be joined to more than one reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoofToRefPlanes { get; }
Visual Basic
Public Shared ReadOnly Property RoofToRefPlanes As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoofToRefPlanes {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace